package com.example.musictheory.data

enum class Tonality(val signCount: Int, val signType: String, val parallTon: String, val rusName: String) {
//    C(0, "Пусто", "a", "До Мажор"),
//    a(0, "Пусто", "C", "Ля Минор"),
    G(1, "Диезы", "e", "Соль Мажор"),
    D(2, "Диезы", "h", "Ре Мажор"),
    A(3, "Диезы", "fis", "Ля Мажор"),
    E(4, "Диезы", "cis", "Ми Минор"),
    H(5, "Диезы", "gis", "Си Мажор"),
    Fis(6, "Диезы", "dis", "Фа-Диез Мажор"),
    e(1, "Диезы", "G", "Ми Минор"),
    h(2, "Диезы", "D", "Си Минор"),
    fis(3, "Диезы", "A", "Фа-Диез Минор"),
    cis(4, "Диезы", "E", "До-Диез Минор"),
    B(2, "Бемоли", "g", "Си-Бемоль Мажор"),
    Es(3, "Бемоли", "c", "Ми-Бемоль Мажор"),



}