package com.example.musictheory.data

enum class Tonality(val signCount: Int, val signType: String, val parallTon: String, val rusName: String) {
//    C(0, "Пусто", "a", "До Мажор"),
//    a(0, "Пусто", "C", "Ля Минор"),
    G(1, "Диезы", "e", "соль мажор"),
    D(2, "Диезы", "h", "ре мажор"),
    A(3, "Диезы", "fis", "ля мажор"),
    E(4, "Диезы", "cis", "ми мажор"),
//    H(5, "Диезы", "gis", "си мажор"),
//    Fis(6, "Диезы", "dis", "фа-диез мажор"),
    e(1, "Диезы", "G", "ми минор"),
    h(2, "Диезы", "D", "си минор"),
    fis(3, "Диезы", "A", "фа-диез минор"),
    cis(4, "Диезы", "E", "до-диез минор"),
    B(2, "Бемоли", "g", "си-бемоль мажор"),
    Es(3, "Бемоли", "c", "ми-бемоль мажор"),
    As(4, "Бемоли", "f", "ля-бемоль мажор"),
    g(2, "Бемоли", "B", "соль минор"),
    c(3, "Бемоли", "Es", "до минор"),
    f(4, "Бемоли", "As", "фа минор")



}