package com.example.musictheory.data

enum class Tonality(val signCount: Int, val signType: String, val mollDur: String, val parallTon: Tonality, val rusName: String, val harmNote:String) {
//    C(0, "Пусто", "a", "До Мажор"),
//    a(0, "Пусто", "C", "Ля Минор"),
    G(1, "Диезы",  "dur","e", "соль мажор", "ми-бемоль"),
    D(2, "Диезы", "dur","h", "ре мажор", "си-бемоль"),
    A(3, "Диезы", "dur","fis", "ля мажор", "фа-бекар"),
    E(4, "Диезы", "dur","cis", "ми мажор", "до-бекар"),
//    H(5, "Диезы", "gis", "си мажор"),
//    Fis(6, "Диезы", "dis", "фа-диез мажор"),
    e(1, "Диезы", "moll","G", "ми минор", "ре-диез"),
    h(2, "Диезы", "moll","D", "си минор", "ля-диез"),
    fis(3, "Диезы", "moll","A", "фа-диез минор", "ми-диез"),
    cis(4, "Диезы", "moll","E", "до-диез минор", "си-диез"),
    B(2, "Бемоли", "dur","g", "си-бемоль мажор", "си-бемоль"),
    Es(3, "Бемоли", "dur","c", "ми-бемоль мажор", "до-бемоль"),
    As(4, "Бемоли", "dur","f", "ля-бемоль мажор", "фа-бемоль"),
    g(2, "Бемоли", "moll", "B", "соль минор", "фа-диез"),
    c(3, "Бемоли", "moll","Es", "до минор", "си-бекар"),
    f(4, "Бемоли", "moll","As", "фа минор", "ми-бекар")



}